snlkuharlocal/src/DataProcessors/КонтрольДеклараций/КонтрольДеклараций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КонтрольДеклараций</name>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/История/История.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>История</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>CatalogRef.Декларация</types>
      <types>CatalogRef.Подразделения</types>
      <types>Date</types>
      <types>Number</types>
      <types>CatalogRef.Контрагенты</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.ПунктыДоставки</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Договоры</types>
      <types>CatalogRef.ТНВЭД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ВводОстатковТМЦ</types>
      <types>DocumentRef.Декларация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Переоценка</types>
      <types>DocumentRef.Машина</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>СуммаВал</name>
    <comment>Сумма в рублях</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <comment>Сумма в валюте расчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата_НачалаЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ_ЗакрытогоПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД_СтрокиПлатежа</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/ДенежныеСредства/ДенежныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредства</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Кассы</types>
      <types>String</types>
      <types>CatalogRef.Контрагенты</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Субзатрата</name>
    <type>
      <types>CatalogRef.СубЗатраты</types>
    </type>
  </attributes>
  <dimensions>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/ВидыПодразделений/ВидыПодразделений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПодразделений</name>
  <enumValues>
    <name>Торговое</name>
  </enumValues>
  <enumValues>
    <name>Управляющее</name>
  </enumValues>
  <enumValues>
    <name>Сервисное</name>
  </enumValues>
  <enumValues>
    <name>Франчайзинг</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/Декларация/Декларация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Декларация</name>
  <attributes>
    <name>ВидДок</name>
    <type>
      <types>EnumRef.ВидыДекларации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Изготовитель</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Орган</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочникДекларации</name>
    <type>
      <types>CatalogRef.Декларация</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>EnumRef.ОрганСертификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьВИсторию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ТипТовара</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Брэнд</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Коллекция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Филиал</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФР_ТипТовара</name>
      <type>
        <types>CatalogRef.ФР_ТипыТовара</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ПереводСредств/ПереводСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПереводСредств</name>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Источник_Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник_Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель_Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель_Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпецНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Источник_Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель_Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПС</types>
    </type>
  </attributes>
</mdclass:Document>

snlkuharlocal/src/DataProcessors/КонтрольДеклараций/ObjectModule.bsl
Процедура Сформировать(ТаблицаПараметров = Неопределено)  Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Декларация.Ссылка КАК Документ
	               |ИЗ
	               |	Документ.Декларация КАК Декларация
	               |ГДЕ
	               |	Декларация.ДатаОкончания > &ДатаОкончания
	               |	И Декларация.Проведен
	               |	И Декларация.Дата >= &ДатаНачала
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Декларация.Дата УБЫВ
	               |АВТОУПОРЯДОЧИВАНИЕ";
				   
Запрос.УстановитьПараметр("ДатаОкончания",ТекущаяДата());
Если ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
Запрос.УстановитьПараметр("ДатаНачала",'20150101');
Иначе
Запрос.УстановитьПараметр("ДатаНачала",'20010101');
КонецЕсли;
Выборка = Запрос.Выполнить().Выбрать();
ТекстПисьма = "";
Пока Выборка.Следующий() Цикл
//	Состояние(Выборка.Документ);

//	ОбработкаПрерыванияПользователя(); 
Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
               |	1 КАК Поле1
               |ИЗ
               |	РегистрСведений.История КАК История
               |ГДЕ
               |	История.Период = &Период
               |	И История.Документ = &Документ";
Запрос.УстановитьПараметр("Период",Выборка.Документ.Дата);
Запрос.УстановитьПараметр("Документ",Выборка.Документ);
Выборка2 = Запрос.Выполнить().Выбрать();
Если Выборка2.Количество() <> Выборка.Документ.Товары.Количество() Тогда
ТекстПисьма = ТекстПисьма + "косяк в декларации "+ Выборка.Документ+ ". "+Выборка.Документ.Изготовитель +Символы.ПС;
//Сообщить(ТекстПисьма);
//Сообщить(Выборка2.Количество());
//Сообщить(Выборка.Документ.Товары.Количество());
//Прервать;
КонецЕсли;
КонецЦикла;

Если ПустаяСтрока(ТекстПисьма) Тогда
ТекстПисьма = "Контроль деклараций: ошибок нет";	
КонецЕсли;


//крохин начало 17.05.2019
//контроль SSR
Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Взаиморасчеты.Регистратор,
				   //крохин начало 06.06.2019
				   |    Взаиморасчеты.Период
				   //крохин конец 06.06.2019
	               |ИЗ
	               |	РегистрНакопления.Взаиморасчеты КАК Взаиморасчеты
	               |ГДЕ
	               |	(Взаиморасчеты.Договор = &Договор
				   |     ИЛИ Взаиморасчеты.Договор = &Договор2)
				   |	И Взаиморасчеты.Контрагент = &Контрагент
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Взаиморасчеты.Период
	               |АВТОУПОРЯДОЧИВАНИЕ";
				   
Запрос.УстановитьПараметр("Договор",Справочники.Договоры.НайтиПоКоду("SNL-020844"));
Запрос.УстановитьПараметр("Договор2",Справочники.Договоры.НайтиПоКоду("SNL-000124"));
Запрос.УстановитьПараметр("Контрагент",Справочники.Контрагенты.НайтиПоКоду("SMN-0139"));
Выборка = Запрос.Выполнить().Выбрать();
Пока Выборка.Следующий() Цикл
	ТекстПисьма = ТекстПисьма + "ошибка во взаиморасчетах по документу: "+Выборка.Регистратор+Символы.ПС; 
КонецЦикла;;

//крохин начало 01.10.2019
//ещё один
Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Взаиморасчеты.Регистратор,
				   |    Взаиморасчеты.Период
	               |ИЗ
	               |	РегистрНакопления.Взаиморасчеты КАК Взаиморасчеты
	               |ГДЕ
	               |	Взаиморасчеты.Договор = &Договор
				   |	И Взаиморасчеты.Контрагент = &Контрагент
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Взаиморасчеты.Период
	               |АВТОУПОРЯДОЧИВАНИЕ";
				   
Запрос.УстановитьПараметр("Договор",Справочники.Договоры.НайтиПоКоду("SNL-000132"));
Запрос.УстановитьПараметр("Контрагент",Справочники.Контрагенты.НайтиПоКоду("SMN-0478"));
Выборка = Запрос.Выполнить().Выбрать();
Пока Выборка.Следующий() Цикл
	ТекстПисьма = ТекстПисьма + "ошибка во взаиморасчетах по документу: "+Выборка.Регистратор+Символы.ПС; 
КонецЦикла;;


//крохин конец 01.10.2019


Если ТекстПисьма = "Контроль деклараций: ошибок нет" Тогда
ТекстПисьма = ТекстПисьма + Символы.ПС + "Контроль взаиморасчетов: ошибок нет"+Символы.ПС;	
КонецЕсли;

ТекстПисьма = ПроверитьДС(ТекстПисьма);

//крохин конец 17.05.2019
ПослатьПисьмо(ТекстПисьма);	
КонецПроцедуры	



Процедура ПослатьПисьмо(Текст) Экспорт
	
	//возврат; //+++
	
	
	попытка
		ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
		ЗаписатьВЛог("Ватком","Отправление почты """+параметрыСеанса.Пользователь+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
	исключение
	конецпопытки;
	
	ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль; 
	
	// Кухарь А.Ю.  08.09.2022 начало
	//ПочтовыйПрофиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//ПочтовыйПрофиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//ПочтовыйПрофиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(ПочтовыйПрофиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец
	
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//ПочтовыйПрофиль.Пользователь       = "*%*%*%";
	//ПочтовыйПрофиль.Пароль             = "*$*$*$";
	ПочтовыйПрофиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Логин;
	ПочтовыйПрофиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	ПочтовыйПрофиль.ВремяОжидания      = 60; 
	
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	
	Сообщение.Получатели.Добавить("krohin@collant.ru");
	Сообщение.Отправитель = "helpdesk@collant.ru";
	Сообщение.Тема = "Контроль корректности в базе " + ПараметрыСеанса.ЭтотУзел.Код;
	Сообщение.Тексты.Добавить(Текст);
	
	Почта = Новый ИнтернетПочта(); 
	Попытка 
		Почта.Подключиться(ПочтовыйПрофиль); 
	Исключение 
		Сообщить(ОписаниеОшибки()); 
		Возврат; 
	КонецПопытки; 
	
	Почта.Подключиться(ПочтовыйПрофиль);
	Почта.Послать(Сообщение);
	Почта.Отключиться();
	
	
КонецПроцедуры	


Функция ПроверитьДС(Текст)
	   СЗ = Новый СписокЗначений;
	   
//РКО	   
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РасходныйКассовыйОрдер.Ссылка,
	|	КоличествоЗаписей.Колво,
	|	ЕСТЬNULL(КоличествоЗаписей.Колво, 0) КАК Колво1
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ДенежныеСредства.Регистратор КАК Регистратор,
	|			СУММА(1) КАК Колво
	|		ИЗ
	|			РегистрНакопления.ДенежныеСредства КАК ДенежныеСредства
	|		ГДЕ
	|			ДенежныеСредства.Период МЕЖДУ &Дата1 И &Дата2
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ДенежныеСредства.Регистратор
    |) КАК КоличествоЗаписей
	|		ПО РасходныйКассовыйОрдер.Ссылка = КоличествоЗаписей.Регистратор
	|ГДЕ
	|	ЕСТЬNULL(КоличествоЗаписей.Колво, 0) = 0
	|	И РасходныйКассовыйОрдер.Дата МЕЖДУ &Дата1 И &Дата2
	|	И РасходныйКассовыйОрдер.Проведен
	|	И РасходныйКассовыйОрдер.Сумма > 0
	|	И РасходныйКассовыйОрдер.Подразделение.ВидПодразделения <> &ВидПодразделения
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасходныйКассовыйОрдер.Ссылка.Дата";
	
	Запрос.УстановитьПараметр("Дата1",КонецДня(Константы.ДатаЗапретаРедактирования.Получить())+1);
	Запрос.УстановитьПараметр("Дата2",КонецМесяца(ТекущаяДата()));
Запрос.УстановитьПараметр("ВидПодразделения",Перечисления.ВидыПодразделений.Франчайзинг);	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	//	ЗаписатьВЛог("Исправление ошибки записи при обмене","Перепроведение "+Выборка.Ссылка,"Информация");
		СЗ.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	//ПКО   
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПриходныйКассовыйОрдер.Ссылка,
	|	КоличествоЗаписей.Колво,
	|	ЕСТЬNULL(КоличествоЗаписей.Колво, 0) КАК Колво1
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ДенежныеСредства.Регистратор КАК Регистратор,
	|			СУММА(1) КАК Колво
	|		ИЗ
	|			РегистрНакопления.ДенежныеСредства КАК ДенежныеСредства
	|		ГДЕ
	|			ДенежныеСредства.Период МЕЖДУ &Дата1 И &Дата2
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ДенежныеСредства.Регистратор
    |) КАК КоличествоЗаписей
	|		ПО ПриходныйКассовыйОрдер.Ссылка = КоличествоЗаписей.Регистратор
	|ГДЕ
	|	ЕСТЬNULL(КоличествоЗаписей.Колво, 0) = 0
	|	И ПриходныйКассовыйОрдер.Дата МЕЖДУ &Дата1 И &Дата2
	|	И ПриходныйКассовыйОрдер.Проведен
	|	И ПриходныйКассовыйОрдер.Сумма > 0
	|	И ПриходныйКассовыйОрдер.Подразделение.ВидПодразделения <> &ВидПодразделения
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПриходныйКассовыйОрдер.Ссылка.Дата";
	
	Запрос.УстановитьПараметр("Дата1",КонецДня(Константы.ДатаЗапретаРедактирования.Получить())+1);
	Запрос.УстановитьПараметр("Дата2",КонецМесяца(ТекущаяДата()));
Запрос.УстановитьПараметр("ВидПодразделения",Перечисления.ВидыПодразделений.Франчайзинг);	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	//	ЗаписатьВЛог("Исправление ошибки записи при обмене","Перепроведение "+Выборка.Ссылка,"Информация");
		СЗ.Добавить(Выборка.Ссылка);
	КонецЦикла;

	
	//ПС  
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПереводСредств.Ссылка,
	|	КоличествоЗаписей.Колво,
	|	ЕСТЬNULL(КоличествоЗаписей.Колво, 0) КАК Колво1
	|ИЗ
	|	Документ.ПереводСредств КАК ПереводСредств
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ДенежныеСредства.Регистратор КАК Регистратор,
	|			СУММА(1) КАК Колво
	|		ИЗ
	|			РегистрНакопления.ДенежныеСредства КАК ДенежныеСредства
	|		ГДЕ
	|			ДенежныеСредства.Период МЕЖДУ &Дата1 И &Дата2
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ДенежныеСредства.Регистратор
    |) КАК КоличествоЗаписей
	|		ПО ПереводСредств.Ссылка = КоличествоЗаписей.Регистратор
	|ГДЕ
	|	ЕСТЬNULL(КоличествоЗаписей.Колво, 0) = 0
	|	И ПереводСредств.Дата МЕЖДУ &Дата1 И &Дата2
	|	И ПереводСредств.Проведен
	|	И ПереводСредств.Сумма > 0
	|	И ПереводСредств.Источник_Подразделение.ВидПодразделения <> &ВидПодразделения
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПереводСредств.Ссылка.Дата";
	
	Запрос.УстановитьПараметр("Дата1",КонецДня(Константы.ДатаЗапретаРедактирования.Получить())+1);
	Запрос.УстановитьПараметр("Дата2",КонецМесяца(ТекущаяДата()));
Запрос.УстановитьПараметр("ВидПодразделения",Перечисления.ВидыПодразделений.Франчайзинг);	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	//	ЗаписатьВЛог("Исправление ошибки записи при обмене","Перепроведение "+Выборка.Ссылка,"Информация");
		СЗ.Добавить(Выборка.Ссылка);
	КонецЦикла;

	
		Если СЗ.Количество() > 0 Тогда
		Текст = Текст +"Ошибки регистра ДС: "+ Символы.ВК;
		
		Для Н = 1 По СЗ.Количество() Цикл
			Текст = Текст + СЗ.Получить(Н-1) + Символы.ВК;
		//	ДокОбъект = СЗ.Получить(Н-1).Значение.ПолучитьОбъект();
		//	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;
		//ПослатьПисьмоОПерепроведении(Текст);
	Иначе
		Текст = Текст +"Нет ошибок регистра ДС "+ Символы.ВК;

	КонецЕсли;

    Возврат Текст;
	
КонецФункции
